_Rarzrabotki/BASEBuh/Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиНалоговыхНазначенийТЗР</xr:Item>
				<xr:Item>InformationRegister.ПорядокЗакрытияПодразделенийОрганизаций</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасчетСписанияРБП</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияКосвенныхРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВРазрезеГарантийныхСроковНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ПриобретенияНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимостиПродукцици</xr:Item>
				<xr:Item>AccumulationRegister.ОжидаемыеНалоговыеРазницы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АмортизацияНМА</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияОС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеНалоговыхРегистровНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаСтоимостиЗапасовБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеТЗР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСтоимостиПродукции</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеРБП</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияНМАНУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияОСНУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНалоговыхРазниц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/BASEBuh/InformationRegisters/УчетнаяПолитикаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетДенежныхСредствПоОбособленнымПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьСуммуДооценокОСВСоставНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформацияОСтатусеПлательщикаНалогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуемыеКлассыСчетовРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыСчетовРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогНаПрибыльБезКорректировокФинансовогоРезультата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогНаПрибыльКонсолидированно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначениеНераспределенныхПостоянныхОПЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеРаспределятьОПЗнаСебестоимостьПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕдиногоНалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРаспределенияРасходовНаОказаниеУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРаспределенияРасходовНаОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиТоваровВРознице</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСебестоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСебестоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиДневнуюНумерациюНалоговыхДокументов</Name>
					<Comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиМесячнуюНумерациюНалоговыхДокументов</Name>
					<Comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</Name>
					<Comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументов</Name>
					<Comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</Name>
					<Comment>Технологические налоговые документы "Не НДС" не будут занимать номера обычных налоговых</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам</Name>
					<Comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной для разных спец. режимов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам</Name>
					<Comment>Будут ли налоговые накладные по ОЦ занимать номер налогой накладной или будут иметь тот же номер, что и основаная налоговая (но тип причины невыдачи = 01)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВыводитьНомерДоговораБезКлеточек</Name>
					<Comment>Чем заполнять пустые показатели (с 2011 г.): Знаком "X", "-", или пустой строкой, например</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах</Name>
					<Comment>только для формы по приказу 1379</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПечататьДатыВНалоговыхНакладныхСРазделителями</Name>
					<Comment>только для формы по приказу 1379</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПечататьКодУКТВЭДБезПробелов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПечататьТитульныйЛистДляПриложения2КНалоговойНакладной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСимволПустыхПоказателейВНалоговойНакладной</Name>
					<Comment>Чем заполнять пустые показатели (с 2011 г.): Знаком "X", "-", или пустой строкой, например</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВыгрузкаПечатьНН_ПоФормеНаДатуДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПриостановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСхемыНалогообложенияВСерединеМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/InformationRegisters/СтатусыПлательщиковЕдиногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПлательщиковЕдиногоНалога</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикЕдиногоНалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ГруппыПлательщиковЕдиногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ГруппыПлательщиковЕдиногоНалога</Name>
			<Comment>Группы плательщиков единого налога</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяГруппаОсобая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШестаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Documents/ЗакрытиеМесяца/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция СоздатьДоначисленияВНУНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	   |	УчетнаяПолитикаОрганизацийЕН.Организация КАК Организация
	   |ПОМЕСТИТЬ ОрганизацииКОбработке
	   |ИЗ
	   |	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийЕН
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийПрибыль
	   |		ПО УчетнаяПолитикаОрганизацийЕН.Организация = УчетнаяПолитикаОрганизацийПрибыль.Организация
	   |			И (УчетнаяПолитикаОрганизацийПрибыль.Период > УчетнаяПолитикаОрганизацийЕН.Период)
	   |			И (УчетнаяПолитикаОрганизацийПрибыль.ПлательщикНалогаНаПрибыль = ИСТИНА)
	   |ГДЕ
	   |	УчетнаяПолитикаОрганизацийЕН.ПлательщикЕдиногоНалога = ИСТИНА
	   |	И УчетнаяПолитикаОрганизацийЕН.ГруппаПлательщикаЕдиногоНалога = ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая)
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СтатусыПлательщиковЕдиногоНалога.Организация КАК Организация,
	   |	НАЧАЛОПЕРИОДА(СтатусыПлательщиковЕдиногоНалога.Период, МЕСЯЦ) КАК ПериодНачало,
	   |	ВЫБОР
	   |		КОГДА МИНИМУМ(ДОБАВИТЬКДАТЕ(СтатусыПлательщиковЕдиногоНалогаОкончание.Период, СЕКУНДА, -1)) < &МаксимальныйПериод
	   |			ТОГДА МИНИМУМ(ДОБАВИТЬКДАТЕ(СтатусыПлательщиковЕдиногоНалогаОкончание.Период, СЕКУНДА, -1))
	   |		ИНАЧЕ &МаксимальныйПериод
	   |	КОНЕЦ КАК ПериодКонец
	   |ИЗ
	   |	РегистрСведений.СтатусыПлательщиковЕдиногоНалога КАК СтатусыПлательщиковЕдиногоНалога
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрганизацииКОбработке КАК ОрганизацииКОбработке
	   |		ПО СтатусыПлательщиковЕдиногоНалога.Организация = ОрганизацииКОбработке.Организация
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПлательщиковЕдиногоНалога КАК СтатусыПлательщиковЕдиногоНалогаОкончание
	   |		ПО (СтатусыПлательщиковЕдиногоНалогаОкончание.Организация = СтатусыПлательщиковЕдиногоНалога.Организация)
	   |			И (СтатусыПлательщиковЕдиногоНалогаОкончание.Период > СтатусыПлательщиковЕдиногоНалога.Период)
	   |			И (СтатусыПлательщиковЕдиногоНалогаОкончание.ГруппаПлательщикаЕдиногоНалога <> ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая))
	   |ГДЕ
	   |	СтатусыПлательщиковЕдиногоНалога.ГруппаПлательщикаЕдиногоНалога = ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая)
	   |	И СтатусыПлательщиковЕдиногоНалога.ПлательщикЕдиногоНалога = ИСТИНА
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	СтатусыПлательщиковЕдиногоНалога.Организация,
	   |	НАЧАЛОПЕРИОДА(СтатусыПлательщиковЕдиногоНалога.Период, МЕСЯЦ)
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	Организация,
	   |	ПериодНачало"; 
	МаксимальныйПериод = '20230731235959';
	Запрос.УстановитьПараметр("МаксимальныйПериод", МаксимальныйПериод);
	
	ТаблицаПериодов = Запрос.Выполнить().Выгрузить();    
	
	Если ТаблицаПериодов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПериодов.Организация КАК Организация,
		|	ТаблицаПериодов.ПериодНачало КАК ПериодНачало,
		|	ТаблицаПериодов.ПериодКонец КАК ПериодКонец
		|ПОМЕСТИТЬ ТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПериодов.Организация КАК Организация,
		|	НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) КАК ПериодДокумента,
		|	МАКСИМУМ(ЗакрытиеМесяца.АмортизацияОСНУ) КАК ЕстьАмортизацияОСНУ,
		|	МАКСИМУМ(ЗакрытиеМесяца.АмортизацияНМАНУ) КАК ЕстьАмортизацияНМАНУ
		|ИЗ
		|	ТаблицаПериодов КАК ТаблицаПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|		ПО ТаблицаПериодов.Организация = ЗакрытиеМесяца.Организация
		|			И (ЗакрытиеМесяца.АмортизацияОСНУ
		|				ИЛИ ЗакрытиеМесяца.АмортизацияНМАНУ)
		|			И (ЗакрытиеМесяца.Дата > ТаблицаПериодов.ПериодНачало)
		|			И (ЗакрытиеМесяца.Дата <= ТаблицаПериодов.ПериодКонец)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПериодов.Организация,
		|	НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ПериодДокумента"; 
	
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	ВыборкаСуществующиеДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Для каждого СтрокаПериодов Из ТаблицаПериодов Цикл
		ТекущийМесяц = СтрокаПериодов.ПериодНачало;
		ВыборкаСуществующиеДокументы.Сбросить();
		Пока ТекущийМесяц < СтрокаПериодов.ПериодКонец Цикл
			
			НуженДокументАмортизацияОСНУ = Истина;
			НуженДокументАмортизацияНМАНУ = Истина;
		
			СтруктураПоиска = Новый Структура("Организация, ПериодДокумента");
			СтруктураПоиска.Организация = СтрокаПериодов.Организация;
			СтруктураПоиска.ПериодДокумента = ТекущийМесяц;          
			Если ВыборкаСуществующиеДокументы.НайтиСледующий(СтруктураПоиска) Тогда
				НуженДокументАмортизацияОСНУ = НЕ ВыборкаСуществующиеДокументы.ЕстьАмортизацияОСНУ;
				НуженДокументАмортизацияНМАНУ = НЕ ВыборкаСуществующиеДокументы.ЕстьАмортизацияНМАНУ;
			КонецЕсли;
			
			Если НуженДокументАмортизацияОСНУ ИЛИ НуженДокументАмортизацияНМАНУ Тогда			

				НовыйДокумент = Документы.ЗакрытиеМесяца.СоздатьДокумент();
				НовыйДокумент.Организация = СтрокаПериодов.Организация;
				НовыйДокумент.Дата = КонецМесяца(ТекущийМесяц);
				НовыйДокумент.АмортизацияОСНУ = НуженДокументАмортизацияОСНУ; 
				НовыйДокумент.АмортизацияНМАНУ = НуженДокументАмортизацияНМАНУ; 				
				НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
				
				ОписаниеНовогоДокумента = ?(НуженДокументАмортизацияОСНУ,"ОЗ","");
				ОписаниеНовогоДокумента = "Нарахування амортизації в ПО для " + ОписаниеНовогоДокумента + ?(НуженДокументАмортизацияНМАНУ,?(ЗначениеЗаполнено(ОписаниеНовогоДокумента)," та ","")+"НМА","");				НовыйДокумент.Комментарий = "#Сформовано автоматично: " + ОписаниеНовогоДокумента;
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			ТекущийМесяц = НачалоМесяца(ДобавитьМесяц(ТекущийМесяц, 1));
		КонецЦикла;
	КонецЦикла;
	
    Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КомандаГрупповоеСозданиеДоначислениеАмортизацииВНУ(Команда)
	
	ТекстВопроса = НСтр("ru='Будут сформированы непроведенные документы 
                         |""Закрытие месяца"" с доначислением амортизации в налоговом учете 
                         |для всех организаций за все периоды единого налога 2%. Продолжить?'
                         |;uk='Будуть сформовані непроведені документи
                         |""Закриття місяця"" з донарахуванням амортизації у податковому обліку 
                         |для всіх організацій за всі періоди єдиного податку 2%. Продовжити?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаГрупповоеСозданиеДоначислениеВНУЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповоеСозданиеДоначислениеВНУЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СоздатьДоначисленияВНУНаСервере();
		Если Результат = Ложь Тогда 
			ТекстПредупреждения = НСтр("ru='Нет организаций, которые были плательщиками единого налога 2%, а затем стали плательщиками налога на прибыль. 
                                |Групповое создание доначислений амортизации в налоговом учете не требуется.'
                                |;uk='Немає організацій, які були платниками єдиного податку 2%, а згодом стали платниками податку на прибуток.
                                |Групове створення донарахувань амортизації у податковому обліку не потрібне.'");
			ПоказатьПредупреждение(,ТекстПредупреждения);
		КонецЕсли;
		ЭтаФорма.Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
		НастройкиДинамическогоСписка();
	КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
